import { GetServerSideProps, NextPage } from 'next'
import { NextSeo } from 'next-seo'
import React, { Fragment } from 'react'
import AdCategoryBlock, { AdCategoryBlockProps } from '@DhivehiChannel/components/blocks/AdCategoryBlock'
import CarouselBlock, { CarouselBlockProps } from '@DhivehiChannel/components/blocks/CarouselBlock'
import CategoryBlock, { CategoryBlockProps } from '@DhivehiChannel/components/blocks/CategoryBlock'
import FeatureBlock, { FeatureBlockProps } from '@DhivehiChannel/components/blocks/FeatureBlock'
import FeatureCategoryBlock, { FeatureCategoryBlockProps } from '@DhivehiChannel/components/blocks/FeatureCategoryBlock'
import FeaturePostBlock, { FeaturePostBlockProps } from '@DhivehiChannel/components/blocks/FeaturePostBlock'

const index:NextPage<Props> = (props) => {
    return (
        <Fragment>
            <NextSeo title={"Dhivehi Channel"} description={"This is the streaming platform for dhivehi channel"} openGraph={{
                url: "",
                title: "",
                description: "",
                siteName: "",
                images: [
                    { url: "" }
                ]
            }} twitter={{ cardType: "summary_large_image" }} />
            {props.blocks.map((blockDetails, index)=>(

                blockDetails.block_name === "feature_block" && 
                    <FeatureBlock key={index} {...blockDetails} />
                ||

                blockDetails.block_name === "feature_category_block" && 
                    <FeatureCategoryBlock key={index} {...blockDetails} />
                ||

                blockDetails.block_name === "ad_category_block" && 
                    <AdCategoryBlock key={index} {...blockDetails} />
                ||

                blockDetails.block_name === "carousel_block" && 
                    <CarouselBlock key={index} {...blockDetails} />
                ||

                blockDetails.block_name === "category_block" && 
                    <CategoryBlock key={index} {...blockDetails} />
                ||

                blockDetails.block_name === "feature_post_block" && 
                    <FeaturePostBlock key={index} {...blockDetails} />
                ||

                null
            ))}
        </Fragment>
    )
}

export default index

export const getServerSideProps:GetServerSideProps<Props> = async (ctx) => {
    const blocks:block[] = [
        {
            block_name: "feature_block",
            posts: [
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image1.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image2.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image3.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                }
            ]
        },
        {
            block_name: "feature_category_block",
            title: "ސިޔާސީ",
            load_more_url: {
                method: "get",
                url: "/",
                headers: {

                },
                body: {

                }
            },
            posts: [
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image1.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image2.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image3.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image4.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                }
            ]
        },
        {
            block_name: "ad_category_block",
            title: "މީޑިއާ ޙަބަރު",
            load_more_url: {
                method: "get",
                url: "/",
                headers: {

                },
                body: {
                    
                }
            },
            posts: [
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image1.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image2.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image3.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image4.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                }
            ]
        },
        {
            block_name: "carousel_block",
            title: "މި އަހަރުގެ އެންމެ މަގުބޫލި ޕްރޯގްރާމްތަށް",
            sub_title: "އެންމެ ފަހު 30 ދުވަސް",
            posts: [
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image1.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image2.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image3.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image4.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image1.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image2.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image3.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image4.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                }
            ]
        },
        {
            block_name: "category_block",
            title: "މީޑިއާ ޙަބަރު",
            load_more_url: {
                method: "get",
                url: "/",
                headers: {

                },
                body: {
                    
                }
            },
            posts: [
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image1.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image2.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image3.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image4.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                }
            ]
        },
        {
            block_name: "feature_post_block",
            title: "މި އަހަރުގެ އެންމެ މަގުބޫލި ޕްރޯގްރާމްތަށް",
            sub_title: "އެންމެ ފަހު 30 ދުވަސް",
            post: {
                title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                category: "ސިޔާސީ",
                comments: 3,
                feature_image: "/image/Image2.png",
                description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                published_at: "2023-06-24T19:46:33.371Z",
                url: "#"
            }
        },
        {
            block_name: "category_block",
            title: "މީޑިއާ ޙަބަރު",
            load_more_url: {
                method: "get",
                url: "/",
                headers: {

                },
                body: {
                    
                }
            },
            posts: [
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image1.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image2.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image3.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image4.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                }
            ]
        },
        {
            block_name: "ad_category_block",
            title: "މީޑިއާ ޙަބަރު",
            load_more_url: {
                method: "get",
                url: "/",
                headers: {

                },
                body: {
                    
                }
            },
            posts: [
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image1.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image2.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image3.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                },
                {
                    title: "ހުކުރު ދުވަހު ކުރާ ހުކުމާއިއެކު، ރައީސް ސޯލިޙް ތާރީޙްގެ ތެރެއަށް.",
                    category: "ސިޔާސީ",
                    comments: 3,
                    feature_image: "/image/Image4.png",
                    description: "އެމްޑީޕީގެ ރައީސް އަދި އެމްޑީޕީގެ ރައީސް މުހައްމަދު ނަޝީދު އިސްވެ ހުންނަވައި އުފެއްދުމަށް މަސައްކަތްކުރާ ސިޔާސީ ޕާޓީއެއްކަމަށްވާ ދަ ޑިމޮކްރެޓްސް އުފެއްދުމަށް ދޭންޖެހޭ ހުއްދަ ދޭނެ ކަމަށް އިލެކްޝަންސް ކޮމިޝަންގެ ރައީސް ފުއާދު ތައުފީގު ވިދާޅުވެއްޖެއެވެ. ޑިމޮކްރެޓްސް' އުފެއްދުމުގެ މަސައްކަތް ކުރުމުގެ ހުއްދަ އިލެކްޝަންސް ކޮމިޝަނުން ދީފައިވަނީ",
                    published_at: "2023-06-24T19:46:33.371Z",
                    url: "#"
                }
            ]
        }
    ]
    return { 
        props: {
            blocks: blocks
        }
    }
}

type block = AdCategoryBlockProps | CarouselBlockProps | CategoryBlockProps | FeatureBlockProps | FeatureCategoryBlockProps | FeaturePostBlockProps

interface Props {
    blocks: block[]
}